## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 8 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                RESOURCE                                 |
|----------|-------------------------------------------------------------------------|
| update   | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-beat&quot;]`   |
|          | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-worker&quot;]` |
|          | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;superset&quot;]`      |
|          | `aws_iam_role.superset_athena_read[&quot;operations_aws_production&quot;]`        |
|          | `aws_iam_role.superset_athena_read[&quot;platform_support_production&quot;]`      |
|          | `module.celery_beat_ecs.aws_ecs_service.this`                           |
|          | `module.celery_worker_ecs.aws_ecs_service.this`                         |
|          | `module.superset_ecs.aws_ecs_service.this`                              |
| recreate | `module.celery_beat_ecs.aws_ecs_task_definition.this`                   |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this`                 |
|          | `module.superset_ecs.aws_ecs_task_definition.this`                      |
| delete   | `aws_iam_policy.superset_athena_read[&quot;all&quot;]`                            |
|          | `aws_iam_role.superset_athena_read[&quot;all&quot;]`                              |
|          | `aws_iam_role_policy_attachment.superset_athena_read[&quot;all&quot;]`            |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-superset/actions/runs/13899609784).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-beat"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-beat-error"
        name           = "celery-beat-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-worker"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-worker-error"
        name           = "celery-worker-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["superset"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "superset-error"
        name           = "superset-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*AccessDenied*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*contains non-numeric values*\" && w1!=\"*DML_NOT_ALLOWED_ERROR*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Error warming up cache*\" && w1!=\"*Failed to execute query*\" && w1!=\"*gsheets error: Unsupported format*\" && w1!=\"*Insufficient permissions to execute the query*\" && w1!=\"*Only `SELECT` statements are allowed*\" && w1!=\"*SQLError*\" && w1!=\"*SYNTAX_ERROR*\" && w1!=\"*Table does not exist*\" && w1!=\"*TABLE_DOES_NOT_EXIST_ERROR*\" && w1!=\"*TABLE_NOT_FOUND*\" && w1!=\"*Unsupported format*\" && w1!=\"*Unsupported table*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.superset_athena_read["all"] will be destroyed
  # (because key ["all"] is not in for_each map)
  - resource "aws_iam_policy" "superset_athena_read" {
      - arn              = "arn:aws:iam::066023111852:policy/SupersetAthenaRead-all" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::066023111852:policy/SupersetAthenaRead-all" -> null
      - name             = "SupersetAthenaRead-all" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "athena:GetDataCatalog"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production"
                      - Sid      = "AthenaDataCatalogAccess"
                    },
                  - {
                      - Action   = [
                          - "athena:StopQueryExecution",
                          - "athena:StartQueryExecution",
                          - "athena:ListWorkGroups",
                          - "athena:ListTagsForResource",
                          - "athena:ListTableMetadata",
                          - "athena:ListQueryExecutions",
                          - "athena:ListNamedQueries",
                          - "athena:ListDatabases",
                          - "athena:ListDataCatalogs",
                          - "athena:GetWorkGroup",
                          - "athena:GetTableMetadata",
                          - "athena:GetQueryResultsStream",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                          - "athena:GetPreparedStatement",
                          - "athena:GetNamedQuery",
                          - "athena:DeletePreparedStatement",
                          - "athena:CreatePreparedStatement",
                          - "athena:BatchGetQueryExecution",
                          - "athena:BatchGetNamedQuery",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AthenaRead"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-transformed-production/*",
                          - "arn:aws:s3:::cds-data-lake-transformed-production",
                          - "arn:aws:s3:::cds-data-lake-curated-production/*",
                          - "arn:aws:s3:::cds-data-lake-curated-production",
                        ]
                      - Sid      = "S3AthenaSourceBucketRead"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-data-lake-athena-production/*",
                          - "arn:aws:s3:::cds-data-lake-athena-production",
                        ]
                      - Sid      = "S3AthenaResultBucketWrite"
                    },
                  - {
                      - Action   = [
                          - "glue:GetTables",
                          - "glue:GetTableVersions",
                          - "glue:GetTableVersion",
                          - "glue:GetTable",
                          - "glue:GetPartitions",
                          - "glue:GetPartition",
                          - "glue:GetDatabases",
                          - "glue:GetDatabase",
                          - "glue:BatchGetPartition",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:glue:ca-central-1:739275439843:table/*/*",
                          - "arn:aws:glue:ca-central-1:739275439843:database/*",
                          - "arn:aws:glue:ca-central-1:739275439843:catalog",
                          - "arn:aws:athena:ca-central-1:066023111852:datacatalog/data-lake-production",
                        ]
                      - Sid      = "GlueRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAQ6X2IXSWHCH5ZISSK" -> null
      - tags             = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all         = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.superset_athena_read["all"] will be destroyed
  # (because key ["all"] is not in for_each map)
  - resource "aws_iam_role" "superset_athena_read" {
      - arn                   = "arn:aws:iam::066023111852:role/SupersetAthenaRead-all" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::066023111852:role/superset_ecs_task_role"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-01-09T20:16:38Z" -> null
      - description           = "This role allows the Superset ECS task to read from all Glue databases" -> null
      - force_detach_policies = false -> null
      - id                    = "SupersetAthenaRead-all" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::066023111852:policy/SupersetAthenaRead-all",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SupersetAthenaRead-all" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROAQ6X2IXSWKCYKMYWXM" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.superset_athena_read["operations_aws_production"] will be updated in-place
  ~ resource "aws_iam_role" "superset_athena_read" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::066023111852:role/superset_ecs_task_role" -> [
                              + "arn:aws:iam::066023111852:role/superset_ecs_task_role",
                              + "arn:aws:iam::066023111852:role/celery-worker_ecs_task_role",
                            ]
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ description           = "This role allows the Superset ECS task to read from the operations_aws_production Glue database" -> "This role allows the Superset ECS task and Celery workers to read from the operations_aws_production Glue database"
        id                    = "SupersetAthenaRead-operations_aws_production"
        name                  = "SupersetAthenaRead-operations_aws_production"
        tags                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.superset_athena_read["platform_support_production"] will be updated in-place
  ~ resource "aws_iam_role" "superset_athena_read" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::066023111852:role/superset_ecs_task_role" -> [
                              + "arn:aws:iam::066023111852:role/superset_ecs_task_role",
                              + "arn:aws:iam::066023111852:role/celery-worker_ecs_task_role",
                            ]
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ description           = "This role allows the Superset ECS task to read from the platform_support_production Glue database" -> "This role allows the Superset ECS task and Celery workers to read from the platform_support_production Glue database"
        id                    = "SupersetAthenaRead-platform_support_production"
        name                  = "SupersetAthenaRead-platform_support_production"
        tags                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.superset_athena_read["all"] will be destroyed
  # (because key ["all"] is not in for_each map)
  - resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      - id         = "SupersetAthenaRead-all-20250109201639070300000001" -> null
      - policy_arn = "arn:aws:iam::066023111852:policy/SupersetAthenaRead-all" -> null
      - role       = "SupersetAthenaRead-all" -> null
    }

  # module.celery_beat_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-beat"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-beat:103" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:75" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat" -> (known after apply)
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 75 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.celery_worker_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "celery-worker"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "celery-worker:106" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:77" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker" -> (known after apply)
      ~ cpu                      = "1024" -> "2048" # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "celery-worker" -> (known after apply)
      ~ memory                   = "2048" -> "4096" # forces replacement
      ~ revision                 = 77 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.superset_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "superset"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "superset:122" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:93" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    command                = [
                        "/app/docker/docker-bootstrap.sh",
                        "app",
                    ]
                    environment            = [
                        {
                            name  = "GOOGLE_AUTH_DOMAIN"
                            value = "superset.cds-snc.ca"
                        },
                        {
                            name  = "GOOGLE_OAUTH_EMAIL_DOMAIN"
                            value = "cds-snc.ca"
                        },
                        {
                            name  = "GOOGLE_OAUTH_LOGIN"
                            value = "true"
                        },
                        {
                            name  = "GUNICORN_KEEPALIVE"
                            value = "120"
                        },
                        {
                            name  = "REDIS_HOST"
                            value = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
                        },
                        {
                            name  = "REDIS_PORT"
                            value = "6379"
                        },
                        {
                            name  = "SUPERSET_DATABASE_DB"
                            value = "superset"
                        },
                        {
                            name  = "THUMBNAIL_SELENIUM_USER"
                            value = "cache-warmer"
                        },
                        {
                            name  = "WEBDRIVER_BASEURL"
                            value = "https://superset.cds-snc.ca"
                        },
                    ]
                    essential              = true
                    image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                    linuxParameters        = {
                        capabilities = {
                            add  = []
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/superset/superset"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "task"
                        }
                    }
                    mountPoints            = []
                    name                   = "superset"
                    portMappings           = [
                        {
                            containerPort = 8088
                            hostPort      = 8088
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "GOOGLE_OAUTH_CLIENT_ID"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_id"
                        },
                        {
                            name      = "GOOGLE_OAUTH_CLIENT_SECRET"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/google_oauth_client_secret"
                        },
                        {
                            name      = "SUPERSET_DATABASE_HOST"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                        {
                            name      = "SUPERSET_DATABASE_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                        {
                            name      = "SUPERSET_DATABASE_USER"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                        {
                            name      = "SUPERSET_SECRET_KEY"
                            valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "superset" -> (known after apply)
      ~ memory                   = "8192" -> "4096" # forces replacement
      ~ revision                 = 93 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      ~ runtime_platform {
          ~ cpu_architecture        = "X86_64" -> "ARM64" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 8 to change, 6 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
